package com.xauv.algorithm.基本数据结构.二叉树.题目;
/*
       /\   /\             /\.__                      
___  __)/___)/  __ _____  _)/|  |   _______  __ ____  
\  \/  /\__  \ |  |  \  \/ / |  |  /  _ \  \/ // __ \ 
 >    <  / __ \|  |  /\   /  |  |_(  <_> )   /\  ___/ 
/__/\_ \(____  /____/  \_/   |____/\____/ \_/  \___  >
      \/     \/                                    \/
*/

/**
 * @Date 2021/12/26 20:31
 * @Author Administrator
 * @Package com.xauv.algorithm.基本数据结构.二叉树.题目
 * @Desc
 *
 * 利用任何一种组合都能还原出二叉树
 *
 * 1.前序+中序
 * 2.后续+中序
 *
 * 3.前序+后续，必须是真二叉树才能唯一还原二叉树，否则情况不唯一，因为左右子树可能有一个为空
 *
 * 因此，要唯一构建二叉树，必须包含 中序遍历
 */
public class 重构二叉树根据遍历的结果推导原树 {


}
