package com.xauv.algorithm.算法.回溯;
/*
       /\   /\             /\.__                      
___  __)/___)/  __ _____  _)/|  |   _______  __ ____  
\  \/  /\__  \ |  |  \  \/ / |  |  /  _ \  \/ // __ \ 
 >    <  / __ \|  |  /\   /  |  |_(  <_> )   /\  ___/ 
/__/\_ \(____  /____/  \_/   |____/\____/ \_/  \___  >
      \/     \/                                    \/
*/

/**
 * @Date 2022/10/27 19:51
 * @Author Administrator
 * @Package com.xauv.algorithm.算法.回溯
 * @Desc
 *
 * 通过选择不同的岔路口来通往目的地
 *
 * 每一步选择一条路出发，能进则进，不能进则退回上一步，换一条路再试
 *
 */
public class 回溯 {


}
