package com.xauv.algorithm.题目.算法实现.数组;
/*
       /\   /\             /\.__                      
___  __)/___)/  __ _____  _)/|  |   _______  __ ____  
\  \/  /\__  \ |  |  \  \/ / |  |  /  _ \  \/ // __ \ 
 >    <  / __ \|  |  /\   /  |  |_(  <_> )   /\  ___/ 
/__/\_ \(____  /____/  \_/   |____/\____/ \_/  \___  >
      \/     \/                                    \/
*/

/**
 * @Date 2022/11/6 14:43
 * @Author Administrator
 * @Package com.xauv.algorithm.题目.算法实现.数组
 * @Desc
 *
 * 1.多指针，
 * 双指针
 *
 * 三指针
 *
 * 从左扫描到右，从右扫描到左
 *
 */
public class 数组问题套路 {
}
