package com.xauv.algorithm.题目.算法实现.数组;
/*
       /\   /\             /\.__                      
___  __)/___)/  __ _____  _)/|  |   _______  __ ____  
\  \/  /\__  \ |  |  \  \/ / |  |  /  _ \  \/ // __ \ 
 >    <  / __ \|  |  /\   /  |  |_(  <_> )   /\  ___/ 
/__/\_ \(____  /____/  \_/   |____/\____/ \_/  \___  >
      \/     \/                                    \/
*/

/**
 * @Date 2022/11/2 20:43
 * @Author Administrator
 * @Package com.xauv.algorithm.题目.算法实现.数组
 * @Desc
 */
public class 颜色分类 {

    /**
     * 给定包含 红 白 蓝色的数组
     * 将他们原地排序，使得 相同颜色 挨在一起
     * 并且按照 红色，白色，蓝色 排序
     *
     * 0 = 红色
     * 1 = 白色
     * 2 = 蓝色
     *
     * 数组：[2,0,2,1,1,0]
     * 分类后：[0,0,1,1,2,2]
     *
     * 分类后，相同数字挨在一起，并且按照从小到大排序
     *
     * 时间复杂度 n， 空间复杂度 1
     */
    public static void sortColor(int[] colors) {

    }
}
